/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Mở rộng Telesec";
"06 06 02 82 06 01 0A 01"		= "Cơ chế Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Xác thực Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Xác thực Mật khẩu";
"06 08 02 82 06 01 0A 01 00 02" = "Xác thực Mật khẩu được Bảo vệ";
"06 08 02 82 06 01 0A 01 00 03" = "Xác thực X.509 Một Chiều";
"06 08 02 82 06 01 0A 01 00 04" = "Xác thực X.509 Hai Chiều";
"06 08 02 82 06 01 0A 01 00 05" = "Xác thực X.509 Ba Chiều";
"06 08 02 82 06 01 0A 01 00 06" = "Xác thực ISO9798 Một Chiều";
"06 08 02 82 06 01 0A 01 00 07" = "Xác thực ISO9798 Hai Chiều";
"06 08 02 82 06 01 0A 01 00 08" = "Xác thực Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Chữ ký của Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 với RSA và ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 với RSA và Tiêu chuẩn Chữ ký Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 với RSA và ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 với RSA và Tiêu chuẩn Chữ ký Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMS-160 với RSA và Tiêu chuẩn Chữ ký Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Chữ ký RSA HBCI";

"06 07 02 82 06 01 0A 01 02"	= "Mã hóa Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "không";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Chức năng Một Chiều";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Băm sử dụng Mã hóa Khối";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Chức năng FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Reed Solomon";

"06 06 02 82 06 01 0A 02"		= "Môđun Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Thuật toán";
"06 07 02 82 06 01 0A 02 01"	= "Loại Thuộc tính";
"06 07 02 82 06 01 0A 02 02"	= "Loại Chứng nhận";
"06 07 02 82 06 01 0A 02 03"	= "Loại Thông báo";
"06 07 02 82 06 01 0A 02 04"	= "Giao thức PL";
"06 07 02 82 06 01 0A 02 05"	= "SME và các Thành phần của SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Các định nghĩa Hữu ích";
"06 07 02 82 06 01 0A 02 08"	= "Tệp STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Đơn hàng Điện tử";
"06 07 02 82 06 01 0A 02 0B"	= "Ứng dụng Không đối xứng TTP của Telesec";
"06 07 02 82 06 01 0A 02 0C"	= "Ứng dụng Cơ sở TTP của Telesec";
"06 07 02 82 06 01 0A 02 0D"	= "Thông báo TTP của Telesec";
"06 07 02 82 06 01 0A 02 0E"	= "Ứng dụng Dấu Thời gian TTP của Telesec";

"06 06 02 82 06 01 0A 03"		= "Lớp Đối tượng";
"06 07 02 82 06 01 0A 03 00"	= "Tên Khác thuộc Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Thư mục";
"06 07 02 82 06 01 0A 03 02"	= "Loại Thư mục";
"06 07 02 82 06 01 0A 03 03"	= "Nhóm Thư mục";
"06 07 02 82 06 01 0A 03 04"	= "Người dùng Thư mục";
"06 07 02 82 06 01 0A 03 05"	= "Nhập Khóa Đối xứng";

"06 06 02 82 06 01 0A 04"		= "Gói";
"06 06 02 82 06 01 0A 05"		= "Tham số";
"06 06 02 82 06 01 0A 06"		= "Liên kết Tên";
"06 06 02 82 06 01 0A 07"		= "Thuộc tính";
"06 07 02 82 06 01 0A 07 00"	= "Định danh Nhóm Ứng dụng";
"06 07 02 82 06 01 0A 07 01"	= "Loại Chứng nhận";
"06 07 02 82 06 01 0A 07 02"	= "Chứng nhận Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Số Chứng nhận";
"06 07 02 82 06 01 0A 07 04"	= "Danh sách Thu hồi Chứng nhận";
"06 07 02 82 06 01 0A 07 05"	= "Ngày Tạo";
"06 07 02 82 06 01 0A 07 06"	= "Nơi cấp";
"06 07 02 82 06 01 0A 07 07"	= "Quyền Đặt tên";
"06 07 02 82 06 01 0A 07 08"	= "Thư mục Khóa Công khai";
"06 07 02 82 06 01 0A 07 09"	= "Miền Bảo mật";
"06 07 02 82 06 01 0A 07 0A"	= "Chủ đề";
"06 07 02 82 06 01 0A 07 0B"	= "Thời gian Thu hồi";
"06 07 02 82 06 01 0A 07 0C"	= "Tham chiếu Nhóm Người dùng";
"06 07 02 82 06 01 0A 07 0D"	= "Giá trị pháp lý";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Môi trường Thông báo Bảo mật";
"06 07 02 82 06 01 0A 07 10"	= "Thư mục Khóa Công khai được Ẩn danh";
"06 07 02 82 06 01 0A 07 11"	= "Tên Thánh Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Phần bổ sung Tên";
"06 07 02 82 06 01 0A 07 13"	= "Mã Bưu điện của Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Phân biệt Tên";
"06 07 02 82 06 01 0A 07 15"	= "Danh sách Chứng nhận Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Danh sách Chứng nhận Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Danh sách Chứng nhận X.509";
"06 07 02 82 06 01 0A 07 18"	= "Thời gian Cấp";
"06 07 02 82 06 01 0A 07 19"	= "Số Thẻ Vật lý";
"06 07 02 82 06 01 0A 07 1A"	= "Loại Tệp";
"06 07 02 82 06 01 0A 07 1B"	= "Tệp Ctl là Lưu trữ";
"06 07 02 82 06 01 0A 07 1C"	= "Địa chỉ Email";
"06 07 02 82 06 01 0A 07 1D"	= "Danh sách Mẫu Chứng nhận";
"06 07 02 82 06 01 0A 07 1E"	= "Tên Thư mục";
"06 07 02 82 06 01 0A 07 1F"	= "Tên Loại Thư mục";
"06 07 02 82 06 01 0A 07 20"	= "Tên Nhóm Thư mục";
"06 07 02 82 06 01 0A 07 21"	= "Tên Người dùng Thư mục";
"06 07 02 82 06 01 0A 07 22"	= "Cờ Thu hồi";
"06 07 02 82 06 01 0A 07 23"	= "Tên Mục nhập Khóa Đối xứng";
"06 07 02 82 06 01 0A 07 24"	= "Số GL";
"06 07 02 82 06 01 0A 07 25"	= "Số GO";
"06 07 02 82 06 01 0A 07 26"	= "Dữ liệu Khóa G";
"06 07 02 82 06 01 0A 07 27"	= "Dữ liệu Khóa Z";
"06 07 02 82 06 01 0A 07 28"	= "Dữ liệu Khóa KT";
"06 07 02 82 06 01 0A 07 2A"	= "Số Khóa KT";
"06 07 02 82 06 01 0A 07 33"	= "Thời gian Tạo Thu hồi";
"06 07 02 82 06 01 0A 07 34"	= "V.bản về TN p.lý";

"06 06 02 82 06 01 0A 08"		= "Nhóm Thuộc tính";
"06 06 02 82 06 01 0A 09"		= "Hành động";
"06 06 02 82 06 01 0A 0A"		= "Thông báo";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Ứng dụng Bảo mật";

"06 06 02 82 06 01 0A 0C"		= "Các định nghĩa Mở rộng CRL và Chứng nhận";

"06 07 02 82 06 01 0A 0C 00"	= "Mở rộng Giới hạn Trách nhiệm pháp lý Gia hạn Chứng nhận";
"06 07 02 82 06 01 0A 0C 01"	= "Mở rộng ID Chứng nhận Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Định danh Chính sách của Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "ID Định danh Chính sách Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Mở rộng CRL đã Lọc của Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Mở rộng Bộ lọc CRL của Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Mở rộng Quyền Đặt tên của Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "ID Người dùng";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Hộp thư RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Thành phần Miền";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Số Doanh nghiệp của Úc";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Định danh Chính sách của Úc về Chứng nhận";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Cá nhân ký kết trên mạng";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Doanh nghiệp mạng";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Pháp lý ký kết trên mạng";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Thí điểm ký số";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Mạng nội bộ ký số";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Định danh Chính sách Ký số";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "Giải thuật Mã hóa Đối xứng";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Định danh Chính sách Bảo đảm Cao SEIS";
"06 06 2A 85 70 22 01 02"	= "Định danh Chính sách GAK SEIS";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Định danh Cá nhân SEIS AT";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "ANSI X9.57 Module";
"06 07 2A 86 48 CE 38 01 01"	= "Quản lý Chứng nhận X9F1";
"06 06 2A 86 48 CE 38 02"		= "Lệnh Kiểm soát";
"06 07 2A 86 48 CE 38 02 01"	= "Lệnh Kiểm soát-Không có";
"06 07 2A 86 48 CE 38 02 02"	= "Nơi cấp Cuộc gọi";
"06 07 2A 86 48 CE 38 02 03"	= "Từ chối";
"06 07 2A 86 48 CE 38 02 04"	= "Mã thông báo Pickup";
"06 06 2A 86 48 CE 38 03"		= "Thuộc tính";
"06 06 2A 86 48 CE 38 03 01"	= "Tín hiệu đáp lại";
"06 06 2A 86 48 CE 38 03 02"	= "Chứng nhận Thuộc tính";
"06 06 2A 86 48 CE 38 04"		= "Thuật toán";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "DSA Match";
"06 07 2A 86 48 CE 38 04 03"	= "DSA với SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Loại Trường ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Trường Chính";
"06 07 2A 86 48 CE 3D 01 02"	= "Trường Đặc tính Hai";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Cơ sở Đặc tính Hai";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Cơ sở Rỗng";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Cơ sở Tam thức";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "Cơ sở Pentanomial";
"06 06 2A 86 48 CE 3D 02"		= "Loại Khóa Công khai";
"06 07 2A 86 48 CE 3D 02 01"	= "Khóa Công khai Đường cong Elip";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Loại Trường ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Trường Galois Quan trọng";
"06 06 2A 86 48 CE 3E 02"		= "Loại Số";
"06 07 2A 86 48 CE 3E 02 01"	= "Khóa Công khai Diffie-Hellman";
"06 06 2A 86 48 CE 3E 03"		= "Giao thức";
"06 07 2A 86 48 CE 3E 03 01"	= "Diffie-Hellman Tĩnh";
"06 07 2A 86 48 CE 3E 03 02"	= "Giao thức trao đổi khóa Diffie-Hellman Tạm thời";
"06 07 2A 86 48 CE 3E 03 03"	= "Diffie-Hellman Hybrid 1";
"06 07 2A 86 48 CE 3E 03 04"	= "Diffie-Hellman Hybrid 2";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Giao phó Thông tin Phiên bản";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE với MD5 và CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC Dựa trên Mật khẩu";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Giao phó Người dùng";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Giao phó Thông tin CA";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Chứng nhận Thuộc tính";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Mã hóa RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Mã hóa RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "Nhãn RSA-OAEP được Chỉ định";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Giao thức Chữ ký RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 với Mã hóa RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 với Mã hóa RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Mã hóa BSAFE RSA";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Thỏa thuận Khóa Diffie-Hellman";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE với MD2 và DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE với MD5 và DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE với MD2 và RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE với MD5 và RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE với MD5 và XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE với SHA và DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "Dữ liệu";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Dữ liệu được Xác thực";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Dữ liệu được Mã hóa";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Mã hóa và Xác thực Thư đồng thời";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Dữ liệu được Thông báo";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Dữ liệu được Mã hóa";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Dữ liệu có Thuộc tính";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Thông tin Khóa Cá nhân được Mã hóa";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Địa chỉ Email";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Tên không có Cấu trúc";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Loại Nội dung";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Sắp xếp Tin nhắn";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Thời gian Xác thực";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Tín hiệu đáp lại";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Mật khẩu Yêu cầu";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Địa chỉ không có Cấu trúc";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Thuộc tính Chứng nhận được Gia hạn";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Nơi cấp và Số Sê ri";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Kiểm tra Mật khẩu";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Khóa Công khai";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Mô tả Xác thực";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Yêu cầu Mở rộng";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Khả năng S/MIME";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Ưa dùng Dữ liệu được Xác thực";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Không thể Giải mã Bất kỳ";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Yêu cầu Nhận";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Nhận";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Gợi ý về Nội dung";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Lịch sử Mở rộng Danh sách Thư";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Môđun S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Cú pháp Thông báo Cryptographic";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Dịch vụ Bảo mật Nâng cao";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Định danh Đối tượng S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Thông báo S/MIME V3";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "ETS Chữ ký Điện tử 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "ETS Chữ ký Điện tử 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "ETS Chính sách Chữ ký Điện tử 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "ETS Chính sách Chữ ký Điện tử 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Loại Nội dung S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Thuộc tính đã Xác thực S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Thuật toán S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Phân phối Chứng nhận S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Phân phối Chứng nhận LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Bộ hạn định Chính sách Chữ ký S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Định danh Loại Chữ ký S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Chữ ký Người tạo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Chữ ký Miền";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Chữ ký Thuộc tính Bổ sung";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Xem lại Chữ ký";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Khả năng S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Ưa dùng Nhị phân Bên trong";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Tên Thân thiện (đối với PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "ID Khóa Địa phương (đối với PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Loại Chứng nhận (đối với PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Chứng nhận X.509 (đối với PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Chứng nhận SDSI (đối với PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Loại CRL (đối với PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "X.509 CRL (đối với PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Cú pháp Trao đổi Thông tin Cá nhân PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "ID Mã hóa Dựa trên Mật khẩu PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE với SHA-1 và RC4 128-Bit";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE với SHA-1 và RC4 40-Bit";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE với SHA-1 và Ba DES-CBC 3 Khóa";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE with SHA-1 and 2-Key Triple DES-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE với SHA-1 và RC2-CBC 128-Bit";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE với SHA-1 và RC2-CBC 40-Bit";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "ID ESPVK PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Bảo vệ Khóa PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "ID Túi PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "ID Túi Khóa PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "ID Túi CRL và Chứng nhận PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "ID Túi Bí mật PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "ID Nội dung An toàn PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "PKCS-12 PKCS-8 Shrouded Key Bag ID";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "ID Túi Chứng nhận PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "ID Túi CRL và Chứng nhận X.509 PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "ID Túi Chứng nhận SDSI PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "OID PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "ID Mã hóa Dựa trên Mật khẩu PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE với SHA-1 và RC4 128-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE với SHA-1 và RC4 40-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE với SHA-1 và Ba DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE với SHA-1 và RC2-CBC 128-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE với SHA-1 và RC2-CBC 40-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE với SHA-1 và RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE với SHA-1 và RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "ID Mã hóa PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Mã hóa PKCS-12 RSA với RC4 128-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Mã hóa PKCS-12 RSA với RC4 40-Bit";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Mã hóa PKCS-12 RSA với Ba DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "ID Chữ ký PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Chữ ký RSA PKCS-12 với Thông báo SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "PKCS-12 Phiên bản 1";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "ID Túi PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Túi Khóa PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Túi Khóa được Bảo vệ PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Túi Chứng nhận PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Túi CRL PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Túi Bí mật PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Túi Nội dung An toàn PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Môđun PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Thuộc tính PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Loại Nội dung PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Nội dung PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Thuật toán Thông báo RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC với SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Thuật toán Mã hóa RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 với MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "RC5-CBC Pad";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Định danh chính sách không xác định của Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos v5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberosr Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Lớp đối tượng của Máy chủ Microsoft Exchange";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Site-Addressing";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Giản đồ Lớp";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Giản đồ Thuộc tính";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Tác nhân Hộp thư";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Hộp thư";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Côngtenơ";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Người nhận Thư";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Cơ chế Gửi";

"06 07 2A 86 48 86 F7 14 04"				= "Các định dạng tệp của Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Xác thực mã";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Bối cảnh Dữ liệu Gián tiếp SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Thông tin về Cơ quan SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Loại Tuyên bố của SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Thông tin về Opus của SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Gia hạn Chứng nhận SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Dữ liệu Hình ảnh PE của SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Liên kết SPC (loại 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Xác thực Mã Cá nhân";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Xác thực Mã Thương mại";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Liên kết SPC (loại 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Các tiêu chuẩn Tối thiểu của SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Các tiêu chí về Tài chính của SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Liên kết SPC (loại 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Nhà cung cấp Hỗ trợ Bảo mật NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Tín hiệu đáp lại Dấu Thời gian";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Danh sách Tin cậy Chứng nhận";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Mở rộng CTL được Sắp xếp";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Địa điểm Cập nhật Tiếp theo";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Sử dụng Khóa Nâng cao";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Xác thực Danh sách Tin cậy Chứng nhận";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Xác thực Dấu Thời gian";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Công nghệ mã hóa dùng Cổng ở Máy chủ";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Mã hóa theo Thứ tự";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Hệ thống Tệp được Mã hóa";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Khôi phục Hệ thống Tệp được Mã hóa";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Tương thích với Phần cứng của Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Xác thực NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Xác thực OEM Phần cứng Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Xác thực NT được Nhúng";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Xác thực Danh sách Gốc Tin cậy";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Phụ thuộc Đủ điều kiệnn";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Khôi phục Khóa";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Xác thực Tài liệu";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Định danh Đối tượng Thuộc tính";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Thuộc tính Tin cậy Có/Không";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Microsoft DRM Individualization";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Giấy phép của Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Máy chủ Cấp phép của Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Định danh Đối tượng PKCS-10 của Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Chứng nhận Gia hạn";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Cặp Giá trị/Tên Đăng ký";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "CSP Đăng ký";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Phiên bản OS";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook Express";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Thuộc tính PKCS-12 của Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Bộ phím cho Máy Nội bộ";

"06 08 2B 06 01 04 01 82 37 14"				= "Cơ sở hạ tầng Đăng ký của Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Sử dụng CTL Tự động Đăng ký";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Loại Chứng nhận Đăng ký";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Tác nhân Đăng ký";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Đăng nhập bằng Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Tên Chính NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Cơ sở hạ tầng Máy chủ Chứng nhận của Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Microsoft CA, Phiên bản Gia hạn";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Phiên bản CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Thuộc tính CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Tên Tài liệu";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Mô tả Tài liệu";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Dữ liệu được Mã hóa";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Nội dung được Mã hóa";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Định danh Chính sách của UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Định danh Chính sách ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Định danh Chính sách CA ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-ECB";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CFB";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-OFB";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal với SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal với RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "Thuộc tính cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "Kiểm tra Sự hiện diện của cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "RTCS Phản hồi OCSP";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "RTCS Phản hồi OCSP được Mở rộng";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Lý do Gia hạn CRL";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Các tính năng của Khóa";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "Khởi động PKI";
"06 09 2B 06 01 04 01 97 55 04 01"			= "Nội dung cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "Dữ liệu Cấu hình cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "Chỉ mục Người dùng cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "Thông tin Người dùng cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Định danh Chính sách XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Dài hạn";
"06 08 2B 06 01 04 01 AA 60 01"		= "Hệ thống Chữ ký Thời gian";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Hệ thống Chữ ký Thời gian 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Hệ thống Chữ ký Thời gian 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Hệ thống Chữ ký Thời gian 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Quy tắc Phụ";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Định danh Bác sỹ";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Dữ liệu Xác thực Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Dữ liệu Khóa Diffie-Hellman của Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Dữ liệu Khóa Hồi đáp của Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Xác thực Máy khách Kerberos";
"06 07 2B 06 01 05 02 03 05"        = "Trung tâm Phân phối Khóa Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Cơ chế Khóa Công khai Đơn giản (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Cơ sở hạ tầng Khóa Công khai";

"06 07 2B 06 01 05 05 07 01"		= "Mở rộng Chứng nhận Cá nhân PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Truy cập Thông tin Quyền Chứng nhận";
"06 08 2B 06 01 05 05 07 01 02"		= "Thông tin Sinh trắc học";
"06 08 2B 06 01 05 05 07 01 03"		= "Tuyên bố Chứng nhận Đủ điều kiện";
"06 08 2B 06 01 05 05 07 01 04"		= "Nhận dạng Kiểm định Chứng chỉ Thuộc tính";
"06 08 2B 06 01 05 05 07 01 05"		= "Xác định Chứng nhận Thuộc tính";
"06 08 2B 06 01 05 05 07 01 06"		= "Kiểm soát Quyền Chứng nhận Thuộc tính";
"06 08 2B 06 01 05 05 07 01 07"		= "Chặn Địa chỉ IP SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Định danh Hệ thống Tự quản SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Định danh Bộ định tuyến SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Ủy nhiệm Chứng nhận Thuộc tính";
"06 08 2B 06 01 05 05 07 01 0B"		= "Truy cập Thông tin trong Chủ đề";
"06 08 2B 06 01 05 05 07 01 0C"		= "Logotype";

"06 07 2B 06 01 05 05 07 02"		= "Loại Bộ hạn định Chính sách";
"06 08 2B 06 01 05 05 07 02 01"		= "Tuyên bố về Sử dụng Chứng nhận";
"06 08 2B 06 01 05 05 07 02 02"		= "T.báo của Ng.dùng";
"06 08 2B 06 01 05 05 07 02 03"		= "Thông báo dạng Văn bản";

"06 07 2B 06 01 05 05 07 03"		= "Mục đích của Khóa";
"06 08 2B 06 01 05 05 07 03 01"		= "Xác thực Máy chủ";
"06 08 2B 06 01 05 05 07 03 02"		= "Xác thực Máy khách";
"06 08 2B 06 01 05 05 07 03 03"		= "Xác thực Mã";
"06 08 2B 06 01 05 05 07 03 04"		= "Bảo vệ Email";
"06 08 2B 06 01 05 05 07 03 05"		= "Hệ thống Cuối của IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Đường hầm IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Người dùng IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Dấu Thời gian";
"06 08 2B 06 01 05 05 07 03 09"		= "Xác thực OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Xác thực Máy chủ SBGP AA";

"06 07 2B 06 01 05 05 07 04"		= "Loại Thông tin CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Chứng nhận Mã hóa Giao thức CA";
"06 08 2B 06 01 05 05 07 04 02"		= "Loại Cặp Khóa Xác thực";
"06 08 2B 06 01 05 05 07 04 03"		= "Loại Cặp Khóa Mã hóa";
"06 08 2B 06 01 05 05 07 04 04"		= "Thuật toán Đối xứng được Ưa dùng";
"06 08 2B 06 01 05 05 07 04 05"		= "Thông tin Cập nhật Khóa CA";
"06 08 2B 06 01 05 05 07 04 06"		= "CRL Hiện tại";
"06 08 2B 06 01 05 05 07 04 07"		= "Các OID không được Hỗ trợ";
"06 08 2B 06 01 05 05 07 04 08"		= "Yêu cầu Đăng ký";
"06 08 2B 06 01 05 05 07 04 09"		= "Phản hồi Đăng ký";
"06 08 2B 06 01 05 05 07 04 0A"		= "Yêu cầu Tham số Cặp Khóa";
"06 08 2B 06 01 05 05 07 04 0B"		= "Phản hồi Tham số Cặp Khóa";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Đăng ký CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Kiểm soát Đăng ký";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Mã thông báo Đăng ký";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Ký hiệu xác nhận";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Thông tin Xuất bản PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Tùy chọn Lưu trữ PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "ID Chứng chỉ Cũ";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Khóa Mã hóa Giao thức";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Mẫu Chứng nhận Thay thế";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Mẫu WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Thông tin Đăng ký CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Cặp UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Yêu cầu Chứng nhận";

"06 07 2B 06 01 05 05 07 06"		= "Thuật toán";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Không có Chữ ký";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Kiểm soát CMC";

"06 07 2B 06 01 05 05 07 08"		= "Tên Khác";
"06 08 2B 06 01 05 05 07 08 01"		= "Dữ liệu Cá nhân";
"06 08 2B 06 01 05 05 07 08 02"		= "Nhóm Người dùng";

"06 07 2B 06 01 05 05 07 09"		= "Dữ liệu Cá nhân";
"06 08 2B 06 01 05 05 07 09 01"		= "Ngày sinh";
"06 08 2B 06 01 05 05 07 09 02"		= "Nơi sinh";
"06 08 2B 06 01 05 05 07 09 03"		= "Bút danh";
"06 08 2B 06 01 05 05 07 09 04"		= "Giới tính";
"06 08 2B 06 01 05 05 07 09 05"		= "Nước Quốc tịch";
"06 08 2B 06 01 05 05 07 09 06"		= "Quốc gia Cư trú";

"06 07 2B 06 01 05 05 07 0A"		= "Chứng nhận Thuộc tính";
"06 08 2B 06 01 05 05 07 0A 01"		= "Thông tin Xác thực";
"06 08 2B 06 01 05 05 07 0A 02"		= "Nhận dạng Truy cập";
"06 08 2B 06 01 05 05 07 0A 03"		= "Nhận dạng Tính cước";
"06 08 2B 06 01 05 05 07 0A 04"		= "Nhóm";
"06 08 2B 06 01 05 05 07 0A 05"		= "Vai trò";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Giao thức Trạng thái Chứng nhận Trực tuyến";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Phản hồi Cơ bản OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Mở rộng OCSP Nonce";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Tham chiếu CRL OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Phản hồi OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Kiểm tra Không Hủy OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Giới hạn Lưu chữ OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Bộ định vị Dịch vụ OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Nơi cấp CA";
"06 08 2B 06 01 05 05 07 30 03"		= "Dấu Thời gian";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "IKE Trung gian";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Thuật toán Mã hóa DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Giải thuật Băm DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD4";
"06 07 2B 0C 02 87 73 07 03"		= "Thuật toán Chữ ký DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 với RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 với RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 với RSA";
"06 05 2B 0E 03 02 03"				= "MD5 với RSA";
"06 05 2B 0E 03 02 04"				= "MD4 với Mã hóa RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N với RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Chữ ký RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA với SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 với Chữ ký RSA";
"06 05 2B 0E 03 02 0F"				= "SHA với Chữ ký RSA";
"06 05 2B 0E 03 02 10"				= "Diffie-Hellman với Môđun Chung";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "DSA Chung";
"06 05 2B 0E 03 02 15"				= "DSA Chung với SHA";
"06 05 2B 0E 03 02 16"				= "Truyền tải Khóa RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 với Chữ ký RSA";
"06 05 2B 0E 03 02 19"				= "MD5 với Chữ ký RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA với SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA với SHA-1 Chung";
"06 05 2B 0E 03 02 1D"				= "SHA-1 với Mã hóa RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 với RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 với ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Tài liệu";
"06 04 2B 24 01 01"					= "Phiên bản Cuối cùng";
"06 04 2B 24 01 02"					= "Nháp";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Thuật toán";
"06 04 2B 24 03 01"					= "Thuật toán Mã hóa";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "DES-ECB Pad";
"06 07 2B 24 03 01 01 01 01"		= "DES-ECB ISO Pad";
"06 07 2B 24 03 01 01 02 01"		= "DES-CBC Pad";
"06 08 2B 24 03 01 01 02 01 01"		= "DES-CBC ISO Pad";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "DES3-ECB Pad";
"06 08 2B 24 03 01 03 01 01 01"		= "DES3-ECB ISO Pad";
"06 07 2B 24 03 01 03 02 01"		= "DES3-CBC Pad";
"06 08 2B 24 03 01 03 02 01 01"		= "DES3-CBC ISO Pad";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "IDEA-ECB Pad";
"06 08 2B 24 03 01 02 01 01 01"		= "IDEA-ECB ISO Pad";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "IDEA-CBC Pad";
"06 08 2B 24 03 01 02 02 01 01"		= "IDEA-CBC ISO Pad";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Mã hóa RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "BSI-1-ECB Pad";
"06 06 2B 24 03 01 05 02"			= "BSI-1-CBC Pad";
"06 07 2B 24 03 01 05 02 01"		= "BSI-1-CBC Pad";

"06 04 2B 24 03 02"					= "Thuật toán Băm";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Độ dài Riêng của MDC2";
"06 05 2B 24 03 02 05"				= "Độ dài Gấp đôi của MDC2";
"06 04 2B 24 03 03"					= "Thuật toán Chữ ký";
"06 05 2B 24 03 03 01"				= "Chữ ký RSA";

"06 06 2B 24 03 03 01 01"			= "Chữ ký RSA với SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Chữ ký RSA với SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Chữ ký RSA với SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Chữ ký RSA với SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Chữ ký RSA với SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Chữ ký RSA với SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Chữ ký RSA với SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Chữ ký RSA với SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Chữ ký RSA với SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Chữ ký RSA với SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Chữ ký RSA với SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Chữ ký RSA với SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Chữ ký RSA với SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Chữ ký RSA với SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Chữ ký RSA với SHA-1 896/L5";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Chữ ký RSA với SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Chữ ký RSA với SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Chữ ký RSA với SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Chữ ký RSA với SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Chữ ký RSA với SHA-1 896/L9";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Chữ ký RSA với SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Chữ ký RSA với SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Chữ ký RSA với SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Chữ ký RSA với SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Chữ ký RSA với SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Chữ ký RSA với SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Chữ ký RSA với RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Chữ ký RSA với RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Chữ ký RSA với RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Chữ ký RSA với RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Chữ ký RSA với RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Chữ ký RSA với RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Chữ ký RSA với RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Chữ ký RSA với RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Chữ ký RSA với RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Chữ ký RSA với RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Chữ ký RSA với RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Chữ ký RSA với RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Chữ ký RSA với RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Chữ ký RSA với RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Chữ ký RSA với RIPEMD-160 896/L5";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Chữ ký RSA với RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Chữ ký RSA với RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Chữ ký RSA với RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Chữ ký RSA với RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Chữ ký RSA với RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Chữ ký RSA với RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Chữ ký RSA với RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Chữ ký RSA với RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Chữ ký RSA với RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Chữ ký RSA với RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Chữ ký RSA với RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Chữ ký RSA với RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Chữ ký RSA với RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Chữ ký ECSIE";
"06 06 2B 24 03 03 02 01"			= "Chữ ký ECSIE với SHA-1";
"06 06 2B 24 03 03 02 02"			= "Chữ ký ECSIE với RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Chữ ký ECSIE với MD2";
"06 06 2B 24 03 03 02 04"			= "Chữ ký ECSIE với MD5";

"06 04 2B 24 03 04"					= "Giao thức Chữ ký";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 với RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 với RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 với RND";

"06 03 2B 24 04"					= "Thuộc tính";
"06 03 2B 24 05"					= "Chính sách";
"06 03 2B 24 06"					= "API";
"06 04 2B 24 06 01"					= "API Cụ thể cho Nhà sản xuất";
"06 05 2B 24 06 01 01"				= "UTIMACO-API";
"06 04 2B 24 06 02"					= "API Cụ thể cho Chức năng";
"06 03 2B 24 07"					= "Quản lý Khóa";
"06 04 2B 24 07 01"					= "Thỏa thuận Khóa";
"06 05 2B 24 07 01 01"				= "BSI PKE";
"06 04 2B 24 07 02"					= "Chuyển Khóa";
"06 05 2B 24 07 02 01"				= "ISO9796-2 với Mã hóa RSA";

"06 05 2B 24 08 01 01"				= "Định danh Chính sách SigiSigConform của Teletrust";
"06 05 2B 24 08 02 01"				= "Dịch vụ Thư mục";

"06 05 2B 24 08 03 01"				= "Ngày Tạo Chứng nhận";
"06 05 2B 24 08 03 02"				= "Ủy quyền";
"06 05 2B 24 08 03 03"				= "Thừa nhận";
"06 05 2B 24 08 03 04"				= "Giới hạn Tài chính";
"06 05 2B 24 08 03 05"				= "Tuyên bố của Đa số";
"06 05 2B 24 08 03 06"				= "Số Sê ri trên Thẻ Mạch Tích hợp";
"06 05 2B 24 08 03 07"				= "Tham chiếu Khóa Công khai";
"06 05 2B 24 08 03 08"				= "Giới hạn";
"06 05 2B 24 08 03 09"				= "Truy xuất Nếu được Cho phép";
"06 05 2B 24 08 03 0A"				= "Chứng nhận được Yêu cầu";
"06 05 2B 24 08 03 0B"				= "Quyền Đặt tên";
"06 05 2B 24 08 03 0C"				= "Chứng nhận Trong Thư mục Kể từ";
"06 05 2B 24 08 03 0D"				= "Dữ liệu Chứng nhận";

"06 05 2B 24 08 04 01"				= "Dữ liệu Cá nhân";
"06 05 2B 24 08 04 08"				= "Giới hạn";
"06 07 2B 24 08 05 01 01 01"		= "RSA biểu thị SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA biểu thị RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA với SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA với RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "DSA Mở rộng";
"06 07 2B 24 08 05 01 02 02"		= "DSA với RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Chứng nhận";
"06 05 2B 24 08 06 02"				= "Tham chiếu Chứng nhận";
"06 05 2B 24 08 06 03"				= "Chứng nhận Thuộc tính";
"06 05 2B 24 08 06 04"				= "Tham chiếu Thuộc tính";
"06 05 2B 24 08 06 05"				= "Tên Tệp";
"06 05 2B 24 08 06 06"				= "Thời gian Lưu";
"06 05 2B 24 08 06 07"				= "Kích cỡ Tệp";
"06 05 2B 24 08 06 08"				= "Địa điểm";
"06 05 2B 24 08 06 09"				= "Số Chữ ký";
"06 05 2B 24 08 06 0A"				= "Tự động tạo";

"06 05 2B 24 08 07 01"				= "Loại Bản trình bày của Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Nhị phân";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Vẽ";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Tái bút";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Văn bản";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Gia hạn Chứng nhận Thawte";
"06 05 2B 65 01 04 01"				= "Extranet Mạnh";

/* X.520 */

"06 02 55 04"		= "Loại Thuộc tính X.520";
"06 03 55 04 00"	= "Lớp Đối tượng";
"06 03 55 04 01"	= "Tên Mục nhập ở dạng Bí danh";
"06 03 55 04 02"	= "Thông tin Kiến thức";
"06 03 55 04 03"	= "Tên Chung";
"06 03 55 04 04"	= "Họ";
"06 03 55 04 05"	= "Số Sê ri";
"06 03 55 04 06"	= "Tên Quốc gia";
"06 03 55 04 07"	= "Tên Vị trí";
"06 04 55 04 07 01"	= "Tên Vị trí Chung";
"06 03 55 04 08"	= "Tên Tỉnh hoặc Tiểu bang";
"06 04 55 04 08 01"	= "Tên Tỉnh hoặc Tiểu bang Chung";
"06 03 55 04 09"	= "Địa chỉ Đường phố";
"06 04 55 04 09 01"	= "Địa chỉ Đường phố Chung";
"06 03 55 04 0A"	= "Tên Tổ chức";
"06 04 55 04 0A 01"	= "Tên Tổ chức Chung";
"06 03 55 04 0B"	= "Tên Đơn vị thuộc Tổ chức";
"06 04 55 04 0B 01"	= "Tên Đơn vị thuộc Tổ chức Chung";
"06 03 55 04 0C"	= "Tiêu đề";
"06 03 55 04 0D"	= "Mô tả";
"06 03 55 04 0E"	= "Hướng dẫn Tìm kiếm";
"06 03 55 04 0F"	= "Loại Doanh nghiệp";
"06 03 55 04 10"	= "Địa chỉ Bưu điện";
"06 04 55 04 10 01"	= "Địa chỉ Bưu điện Chung";
"06 03 55 04 11"	= "Mã Bưu điện";
"06 04 55 04 11 01"	= "Mã Bưu điện Chung";
"06 03 55 04 12"	= "Hòm thư";
"06 04 55 04 12 01"	= "Hòm thư Chung";
"06 03 55 04 13"	= "Tên Văn phòng Gửi";
"06 04 55 04 13 01"	= "Tên Văn phòng Gửi Vật lý Chung";
"06 03 55 04 14"	= "Số Điện thoại";
"06 04 55 04 14 01"	= "Số Điện thoại Chung";
"06 03 55 04 15"	= "Số Telex";
"06 04 55 04 15 01"	= "Số Telex Chung";
"06 03 55 04 16"	= "Định danh Đầu cuối Teletex";
"06 04 55 04 16 01"	= "Định danh Đầu cuối Teletex Chung";
"06 03 55 04 17"	= "Số Điện thoại Fax";
"06 04 55 04 17 01"	= "Số Điện thoại Fax Chung";
"06 03 55 04 18"	= "Địa chỉ X.121";
"06 03 55 04 19"	= "Số ISDN Quốc tế";
"06 04 55 04 19 01"	= "Số ISDN Quốc tế Chung";
"06 03 55 04 1A"	= "Địa chỉ đã Đăng ký";
"06 03 55 04 1B"	= "Chỉ báo Nơi đến";
"06 03 55 04 1C"	= "Phương pháp Gửi được Ưa dùng";
"06 03 55 04 1D"	= "Địa chỉ Bản trình bày";
"06 03 55 04 1E"	= "Bối cảnh Ứng dụng được Hỗ trợ";
"06 03 55 04 1F"	= "Thành viên";
"06 03 55 04 20"	= "Chủ nhân";
"06 03 55 04 21"	= "Người nắm giữ Vai trò";
"06 03 55 04 22"	= "Xem Thêm";
"06 03 55 04 23"	= "Mật khẩu Người dùng";
"06 03 55 04 24"	= "Chứng nhận của Người dùng";
"06 03 55 04 25"	= "Chứng nhận CA";
"06 03 55 04 26"	= "Danh sách Thu hồi Quyền";
"06 03 55 04 27"	= "Danh sách Thu hồi Chứng nhận";
"06 03 55 04 28"	= "Cặp Chứng nhận Chéo";
"06 03 55 04 29"	= "Tên";
"06 03 55 04 2A"	= "Tên thánh";
"06 03 55 04 2B"	= "Tên viết tắt";
"06 03 55 04 2C"	= "Bộ hạn định Tạo";
"06 03 55 04 2D"	= "Định danh Duy nhất";
"06 03 55 04 2E"	= "Bộ hạn định DN";
"06 03 55 04 2F"	= "Hướng dẫn Tìm kiếm Nâng cao";
"06 03 55 04 30"	= "Thông tin về Giao thức";
"06 03 55 04 31"	= "Tên Phân biệt";
"06 03 55 04 32"	= "Thành viên Duy nhất";
"06 03 55 04 33"	= "Định danh Nhàifier";
"06 03 55 04 34"	= "Các thuật toán được Hỗ trợ";
"06 03 55 04 35"	= "Danh sách Thu hồi Delta";
"06 03 55 04 36"	= "Khoảng hở";
"06 03 55 04 3A"	= "Cặp Chứng nhận Chéo";

/* X.500 object classes */

"06 02 55 06"		= "Lớp Đối tượng X.520";
"06 03 55 06 00"	= "Trên";
"06 03 55 06 01"	= "Bí danh";
"06 03 55 06 02"	= "Quốc gia";
"06 03 55 06 03"	= "Vị trí";
"06 03 55 06 04"	= "Tổ chức";
"06 03 55 06 05"	= "Đơn vị thuộc Tổ chức";
"06 03 55 06 06"	= "Nhân viên";
"06 03 55 06 07"	= "Nhân viên thuộc Tổ chức";
"06 03 55 06 08"	= "Vai trò trong Tổ chức";
"06 03 55 06 09"	= "Nhóm Tên";
"06 03 55 06 0A"	= "Người Cư trú";
"06 03 55 06 0B"	= "Quá trình Đăng ký";
"06 03 55 06 0C"	= "Đối tượng Ứng dụng";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Thiết bị";
"06 03 55 06 0F"	= "Người dùng Xác thực Tốt";
"06 03 55 06 10"	= "Quyền Chứng nhận";
"06 03 55 06 11"	= "Nhóm Tên Duy nhất";
"06 03 55 06 15"	= "Người dùng PKI";
"06 03 55 06 16"	= "PKI CA";

/* X.500 algorithms */

"06 02 55 08"		= "Các thuật toán X.500";
"06 03 55 08 01"	= "Các thuật toán Mã hóa X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Gia hạn Chứng nhận X.509";
"06 03 55 1D 01"	= "Định danh Khóa Quyền (cũ)";
"06 03 55 1D 02"	= "Thuộc tính Khóa Chính (cũ)";
"06 03 55 1D 03"	= "Chính sách Chứng nhận (cũ)";
"06 03 55 1D 04"	= "Hạn chế Sử dụng Khóa (cũ)";
"06 03 55 1D 05"	= "Vạch ra Chính sách (cũ)";
"06 03 55 1D 06"	= "Giới hạn Subtrees";
"06 03 55 1D 07"	= "Tên Khác của Chủ đề (cũ)";
"06 03 55 1D 08"	= "Tên Khác của Nơi cấp (cũ)";
"06 03 55 1D 09"	= "Thuộc tính Thư mục của Chủ đề";
"06 03 55 1D 0A"	= "Những hạn chế Cơ bản (2.5.29.10 cũ)";
"06 03 55 1D 0B"	= "Giới hạn Tên (cũ)";
"06 03 55 1D 0C"	= "Giới hạn Chính sách (cũ)";
"06 03 55 1D 0D"	= "Những hạn chế Cơ bản (2.5.29.13 cũ)";
"06 03 55 1D 0E"	= "Định danh Khóa Chủ đề";
"06 03 55 1D 0F"	= "Sử dụng Khóa";
"06 03 55 1D 10"	= "Thời gian Sử dụng Khóa Cá nhân";
"06 03 55 1D 11"	= "Tên Khác của Chủ đề";
"06 03 55 1D 12"	= "Tên Khác của Nơi cấp";
"06 03 55 1D 13"	= "Những hạn chế Cơ bản";
"06 03 55 1D 14"	= "Số Danh sách Thu hồi Chứng nhận";
"06 03 55 1D 15"	= "Mã Lý do CRL";
"06 03 55 1D 16"	= "Ngày Hết hạn (cũ)";
"06 03 55 1D 17"	= "Mã Lệnh Kiểm soát";
"06 03 55 1D 18"	= "Ngày Hết hiệu lực";
"06 03 55 1D 19"	= "Điểm Phân phối CRL (cũ)";
"06 03 55 1D 1A"	= "Điểm Phân phối Cấp phát (cũ)";
"06 03 55 1D 1B"	= "Chỉ báo CRL Delta";
"06 03 55 1D 1C"	= "Điểm Phân phối Cấp phát";
"06 03 55 1D 1D"	= "Nơi cấp Chứng nhận";
"06 03 55 1D 1E"	= "Giới hạn Tên";
"06 03 55 1D 1F"	= "Điểm Phân phối CRL";
"06 03 55 1D 20"	= "Chính sách Chứng nhận";
"06 04 55 1D 20 00"	= "Định danh Chính sách Bất kỳ";
"06 03 55 1D 21"	= "Vạch ra Chính sách";
"06 03 55 1D 22"	= "Giới hạn Chính sách";
"06 03 55 1D 23"	= "Định danh Khóa Quyền";
"06 03 55 1D 24"	= "Giới hạn Chính sách";
"06 03 55 1D 25"	= "Sử dụng Khóa Mở rộng";
"06 04 55 1D 25 00"	= "Sử dụng Khóa Mở rộng Bất kỳ";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Thuật toán Chữ ký SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Thuật toán Chữ ký Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Thuật toán Bảo mật SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Thuật toán Bảo mật Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Thuật toán Toàn vẹn SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Thuật toán Tính toàn vẹn Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Thuật toán Bảo vệ Mã thông báo SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Thuật toán Bảo vệ Mã thông báo Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Thuật toán Quản lý Khóa SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Thuật toán Quản lý Khóa Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Thuật toán Chữ ký và Quản lý Khóa SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Thuật toán Chữ ký và Quản lý Khóa Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Thuật toán Chữ ký Bộ A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Thuật toán Bảo mật Bộ A";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Thuật toán Tính toàn vẹn Bộ A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Thuật toán Bảo vệ Mã thông báo Bộ A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Thuật toán Quản lý Khóa Bộ A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Thuật toán Chữ ký và Quản lý Khóa Bộ A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Thuật toán Chữ ký Cập nhật Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Thuật toán Chữ ký Cập nhật và Quản lý Khóa Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Thuật toán Tính toàn vẹn Cập nhật Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Thuật toán Trao đổi Khóa";
"06 09 60 86 48 01 65 02 01 01 17"	= "Thuật toán Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "Thuật toán Mã hóa Khóa (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Định dạng Thông báo RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Nội dung Trống";
"06 09 60 86 48 01 65 02 01 02 03"	= "Loại Nội dung CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Loại Nội dung MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Loại Nội dung MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Giao thức Tác nhân MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Loại Nội dung MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Phần Nội dung của Thông báo MSP được Chuyển tiếp";
"06 09 60 86 48 01 65 02 01 02 49"	= "Tham số Thông báo đã Chuyển tiếp MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Phần Nội dung của Thông báo CSP được Chuyển tiếp";
"06 09 60 86 48 01 65 02 01 02 51"	= "Tham số Thông báo đã Chuyển tiếp CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Chính sách Bảo mật SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Chính sách Bảo mật";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Chung";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Chính sách Bảo mật Mặc định";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Chứng nhận Quản lý Khóa SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Chứng nhận Chữ ký Người dùng SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Chứng nhận Chữ ký và Quản lý Khóa SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Chứng nhận Quản lý Khóa Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Chứng nhận Chữ ký và Quản lý Khóa Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Chứng nhận Chữ ký Người dùng Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Chứng nhận Chữ ký Fortezza CA";
"06 09 60 86 48 01 65 02 01 05 08"	= "Chứng nhận Chữ ký CA SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Vectơ Phụ";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Chính sách Nhận";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Tư cách thành viên";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Quản trị viên";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKM";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKM";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "CKL Chữ ký SDNS Meta";
"06 09 60 86 48 01 65 02 01 05 2B"	= "CKL Chữ ký SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Danh sách Thu hồi Chứng nhận SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Danh sách Thu hồi Chứng nhận Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Trình xử lý Địa chỉ Được miễn";
"06 09 60 86 48 01 65 02 01 05 30"	= "Bảo vệ";
"06 09 60 86 48 01 65 02 01 05 31"	= "Các thuật toán được Hỗ trợ";
"06 09 60 86 48 01 65 02 01 05 32"	= "Chứng nhận Quản lý Khóa Bộ A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Chứng nhận Chữ ký và Quản lý Khóa Bộ A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Chứng nhận Chữ ký Người dùng Bộ A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Thông tin PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Giới hạn CA PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Đặc quyền Quản lý Khóa hoặc Chữ ký";
"06 09 60 86 48 01 65 02 01 05 38"	= "Đặc quyền Chung";
"06 09 60 86 48 01 65 02 01 05 39"	= "Thuộc tính đã được gắn Nhãn";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Tệp Thông tin Chính sách";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Tệp Thông tin Chính sách Sec";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Hạn chế Người sử dụng thông tin bí mật";

"06 09 60 86 48 01 65 02 01 07 01"		= "Mở rộng CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Loại Bảo mật ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Đặc quyền Nhãn Bảo mật Chuẩn";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Đặc quyền Chữ ký";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Đặc quyền Quản lý Khóa";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Đặc quyền Nhóm Thẻ đã Đặt tên";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Bộ Quốc phòng Mỹ - Lớp 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Bộ Quốc phòng Mỹ - Lớp 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Bộ Quốc phòng Mỹ - Lớp 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Bộ Quốc phòng Mỹ - Lớp 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Bộ Quốc phòng Mỹ - Lớp PKI 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Kiểm tra Chính sách Bảo mật";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 Nhóm Thẻ Không";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 Nhóm Thẻ Một";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 Nhóm Thẻ Hai";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Loại Bảo mật TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 Nhóm Thẻ Không";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 Nhóm Thẻ Một";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 Nhóm Thẻ Một";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Loại Bảo mật Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Tên Nhóm Thẻ Kafka 1";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Tên Nhóm Thẻ Kafka 2";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Tên Nhóm Thẻ Kafka 3";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Kiểm tra Mục nhập CRL";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Nhãn";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Định danh Chính sách GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Định danh Chính sách Sơ đẳng FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Định danh Chính sách Cơ bản FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Định danh Chính sách Trung bình FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Định danh Chính sách Cao FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Khóa KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Mở rộng";
"06 09 60 86 48 01 65 03 02 03 01"		= "Kỹ thuật Khôi phục Khóa";
"06 09 60 86 48 01 65 03 02 03 02"		= "Có khả năng Khôi phục Khóa";
"06 09 60 86 48 01 65 03 02 03 03"		= "Khôi phục Khóa";
"06 08 60 86 48 01 65 03 02 04"			= "Giao thức Khôi phục Khóa";
"06 08 60 86 48 01 65 03 02 05"			= "Mở rộng CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Thuật toán NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Thuật toán Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "DES-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "DES-EDE2-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "DES-EDE3-CBC Pad IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "RC5-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 với BSAFE1 Mã hóa RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 với BSAFE1 Mã hóa RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 với BSAFE1 Mã hóa RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Thông báo LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC với SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC với MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "RC2-CBC Pad";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Gói MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "BSAFE1 Mã hóa RSA";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Mật khẩu NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Loại Thuộc tính PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Thuộc tính Bảo mật";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Giới hạn Tin cậy";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Định danh Đối tượng của Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Gia hạn Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Loại Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "URL Cơ sở của Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL Thu hồi của Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL Thu hồi CA của Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL Tải về CRL của Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL Tải về Chứng nhận CA của Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL Gia hạn Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL Chính sách CA của Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL Trang chủ Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Logo Thực thể Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Ảnh Người dùng Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Tên Máy chủ SSL của Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Nhận xét Chứng nhận của Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Loại Dữ liệu của Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "hình ảnh/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "hình ảnh/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL";
"06 09 60 86 48 01 86 F8 42 02 04"	= "văn bản/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Trình tự Chứng nhận của Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL Chứng nhận của Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Định danh Đối tượng Thư mục của Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Các định nghĩa LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Giấy phép Lái xe";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Số Phòng ban";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Mã số Nhân viên";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Loại Nhân viên";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Nhân viên thuộc Tổ chức Mạng nội bộ";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Công nghệ mã hóa dùng Cổng ở Máy chủ";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Hộp thư đến của Verisign";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Mở rộng Verisign VPN không xác định";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Mở rộng Verisign VPN không xác định";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Định danh Chính sách của Verisigner";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Thông báo của Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "NSI của Verisign CPS v1";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "Verisign SGC CA";

/* SET */

"06 03 67 2A 00"	= "Loại Nội dung";
"06 04 67 2A 00 00"	= "Dữ liệu PAN";
"06 04 67 2A 00 01"	= "Mã thông báo PAN";
"06 04 67 2A 00 02"	= "Chỉ cho PAN";

"06 03 67 2A 01"	= "Mở rộng Thông báo";
"06 03 67 2A 02"	= "Trường";
"06 04 67 2A 02 00"	= "Họ và Tên";
"06 04 67 2A 02 01"	= "Tên thánh";
"06 04 67 2A 02 02"	= "Họ";
"06 04 67 2A 02 03"	= "Họ trong Khai sinh";
"06 04 67 2A 02 04"	= "Tên Vị trí";
"06 04 67 2A 02 05"	= "Số Nhận dạng";
"06 04 67 2A 02 06"	= "Tháng";
"06 04 67 2A 02 07"	= "Ngày";
"06 04 67 2A 02 08"	= "Địa chỉ";
"06 04 67 2A 02 09"	= "Điện thoại";
"06 04 67 2A 02 0A"	= "Số lượng";
"06 04 67 2A 02 0B"	= "Số Tài khoản";
"06 04 67 2A 02 0C"	= "Cụm từ mật khẩu";

"06 03 67 2A 03"		= "Thuộc tính";
"06 04 67 2A 03 00"		= "Chứng nhận";
"06 05 67 2A 03 00 00"	= "Ký hiệu Khóa Gốc";
"06 05 67 2A 03 00 01"	= "Chính sách Bổ sung";

"06 03 67 2A 04"	= "Thuật toán";
"06 03 67 2A 05"	= "Chính sách";
"06 04 67 2A 05 00"	= "Gốc";
"06 03 67 2A 06"	= "Môđun";
"06 03 67 2A 07"	= "Gia hạn Chứng nhận";
"06 04 67 2A 07 00"	= "Khóa Gốc sử dụng Băm";
"06 04 67 2A 07 01"	= "Loại Chứng nhận";
"06 04 67 2A 07 02"	= "Dữ liệu Bán hàng";
"06 04 67 2A 07 03"	= "Yêu cầu có Chứng nhận Thẻ";
"06 04 67 2A 07 04"	= "Tạo đường hầm";
"06 04 67 2A 07 05"	= "THIẾT LẬP Mở rộng";
"06 04 67 2A 07 06"	= "THIẾT LẬP Bộ hạn định";

"06 03 67 2A 08"	= "Nhãn";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Bữa tối";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Nhà cung cấp";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Giao phó";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Quốc gia";
"06 05 67 2A 0A E2 00"	= "Nhật Bản";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Khóa Gốc sử dụng Băm";
"06 04 86 8D 6F 03"	= "Loại Chứng nhận";
"06 04 86 8D 6F 04"	= "Dữ liệu Bán hàng";
"06 04 86 8D 6F 05"	= "Yêu cầu Chứng nhận Thẻ";
"06 04 86 8D 6F 06"	= "Tạo đường hầm";
"06 04 86 8D 6F 07"	= "THIẾT LẬP Bộ hạn định";
"06 04 86 8D 6F 63"	= "T.LẬP D.liệu";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Bảo mật Dữ liệu của Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Định danh Chính sách Tin cậy của Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Chính sách iSign của Apple";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Chính sách Cơ bản X.509 của Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Chính sách SSL của Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Chính sách Tạo Chứng nhận Địa phương của Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Chính sách Tạo CSR Địa phương của Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Chính sách Thu hồi CRL của Apple";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Chính sách Thu hồi OCSP của Apple";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Chính sách S/MIME của Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Chính sách Xác thực Có thể mở rộng của Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Chính sách Xác thực Cập nhật Phần mềm của Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Chính sách IPsec của Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Chính sách iChat của Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Chính sách Xác thực Tài nguyên của Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Chính sách Máy khách Kerberos của Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Chính sách Máy chủ Kerberos của Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Chính sách Xác thực Mã của Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Chính sách Xác thực Gói của Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Định danh Thuật toán Bảo mật của Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Mã hóa Elip Nhanh (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Nén An toàn của Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "FEE với Chữ ký MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "FEE với Chữ ký SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Mã hóa NGUỒN CẤP DỮ LIỆU của Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "NGUỒN CẤP DỮ LIỆU của Apple (thử nghiệm)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "FEE với Chữ ký ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Định danh Chứng nhận Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Yêu cầu Chứng nhận Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Yêu cầu Chứng nhận Nhận dạng Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Yêu cầu Chứng nhận Mã hóa Email Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Yêu cầu Chứng nhận Mã hóa Email Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Yêu cầu Liệt kê Lưu trữ Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Yêu cầu Lưu Lưu trữ Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Yêu cầu Tỉm nạp Lưu trữ Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Yêu cầu Xóa Lưu trữ Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Gia hạn Chứng nhận Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Nhận dạng Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Mã hóa Email Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Mã hóa Email Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Giá trị Yêu cầu Chứng nhận Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Tên Người dùng";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Mật khẩu";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Tên Máy chủ";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Cờ Gia hạn";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Cờ Không đồng bộ";

"06 08 2A 86 48 86 F7 63 64 04" = "Sử dụng Khóa Mở rộng của Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Xác thực Mã của Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Xác thực Mã của Apple (Phát triển)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Xác thực Cập nhật Phần mềm của Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Xác thực Mã của Apple (Bảo lưu)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Xác thực Tài nguyên của Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Mã hóa iChat của Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Mã hóa iChat của Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Nhận dạng Hệ thống Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Các chính sách Chứng nhận của Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Chính sách Chứng nhận của Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Chính sách Chứng nhận Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Xác thực Mã";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Bảo mật CDSA của Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Định dạng Bảo mật CDSA của Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Gia hạn Chứng nhận X.509v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Gia hạn Chứng nhận Cá nhân X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Định dạng Bitmap cho Chữ ký Chủ đề";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Ảnh Chủ đề";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Địa chỉ Email của Chủ đề";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Sử dụng Miễn trừ";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Thuật toán Bảo mật CDSA của Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 với ECDSA";

/* end */
